---
kind: method
id: M:Autodesk.Revit.DB.FilteredElementIdIterator.IsDone
source: html/d97c9f2b-33a3-128b-fad4-00fba014c1a6.htm
---
# Autodesk.Revit.DB.FilteredElementIdIterator.IsDone Method

Identifies if the iteration has completed.

## Syntax (C#)
```csharp
public virtual bool IsDone()
```

## Returns
True if the iteration has no more matching elements. False if there are more element ids to be iterated.

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - The FilteredElementCollector that yielded this iterator has been reset by another operation.
 No further iteration is permitted with this iterator.